app/controllers/posts_controller.rb

    def show
        # raise params.inspect
        @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]